In [64]:
import pandas as pd
import numpy as np

In [65]:
df = pd.read_csv('titanic.csv')
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [66]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis=1,inplace=True)

In [67]:
df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [68]:
target = df.Survived
inputs = df.drop('Survived',axis=1)

In [69]:
dummies = pd.get_dummies(inputs.Sex)
dummies.head()

   female  male
0       0     1
1       1     0
2       1     0
3       1     0
4       0     1

In [70]:
inputs = pd.concat([inputs,dummies],axis='columns')
inputs.head(3)

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0

In [71]:
inputs.drop(['Sex'],axis=1,inplace=True)

In [72]:
inputs.head(3)

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0

In [73]:
#checking for null values
inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

In [74]:
inputs.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [75]:
inputs.Age = inputs.Age.fillna(inputs.Age.mean())

In [76]:
inputs.Age[:10]

0    22.000000
1    38.000000
2    26.000000
3    35.000000
4    35.000000
5    29.699118
6    54.000000
7     2.000000
8    27.000000
9    14.000000
Name: Age, dtype: float64

In [85]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(inputs, target, test_size=0.2)

In [86]:
len(X_train)

712

In [87]:
len(X_test)

179

In [88]:
len(y_train)

712

In [89]:
len(y_test)

179

In [90]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [91]:
model.fit(X_train,y_train)

GaussianNB()

In [92]:
model.score(X_test,y_test)

0.8212290502793296

In [95]:
y_test[:10]

366    1
493    0
262    0
279    1
832    0
721    0
101    0
780    1
358    1
15     1
Name: Survived, dtype: int64

In [94]:
model.predict(X_test[:10])

array([1, 0, 0, 1, 0, 0, 0, 1, 1, 1], dtype=int64)